DigiFennek/TransputerBox/MCUXpresso/transputerBox_WinUSB_cm4/board/pin_mux.h
/*! @name PIO1_1 (number 15), Fan Tacho 2
  @{ */
#define BOARD_FAN_TACHO_2_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_FAN_TACHO_2_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_FAN_TACHO_2_PIN 1U    /*!<@brief 1U pin index: 1 */
                                    /* @} */

/*! @name PIO0_2 (number 36), Reset
  @{ */
#define BOARD_RESET_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_RESET_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_RESET_PIN 2U    /*!<@brief 0U pin index: 2 */
                              /* @} */

/*! @name PIO0_3 (number 37), Power On
  @{ */
#define BOARD_PON_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_PON_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_PON_PIN 3U    /*!<@brief 0U pin index: 3 */
                            /* @} */

/*! @name PIO0_5 (number 39), Link Speed
  @{ */
#define BOARD_LINK_SPEED_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_LINK_SPEED_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_LINK_SPEED_PIN 5U    /*!<@brief 0U pin index: 5 */
                                   /* @} */

/*! @name PIO0_6 (number 40), Test
  @{ */
#define BOARD_TEST_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_TEST_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_TEST_PIN 6U    /*!<@brief 0U pin index: 6 */
                             /* @} */

/*! @name PIO0_7 (number 41), C012 D0
  @{ */
#define BOARD_C012_D0_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D0_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D0_PIN 7U    /*!<@brief 0U pin index: 7 */
                                /* @} */

/*! @name PIO0_8 (number 43), C012 D1
  @{ */
#define BOARD_C012_D1_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D1_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D1_PIN 8U    /*!<@brief 0U pin index: 8 */
                                /* @} */

/*! @name PIO0_9 (number 44), C012 D2
  @{ */
#define BOARD_C012_D2_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D2_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D2_PIN 9U    /*!<@brief 0U pin index: 9 */
                                /* @} */

/*! @name PIO0_10 (number 45), C012 D3
  @{ */
#define BOARD_C012_D3_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D3_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D3_PIN 10U   /*!<@brief 0U pin index: 10 */
                                /* @} */

/*! @name PIO0_11 (number 46), C012 D4
  @{ */
#define BOARD_C012_D4_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D4_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D4_PIN 11U   /*!<@brief 0U pin index: 11 */
                                /* @} */

/*! @name PIO0_12 (number 47), C012 D5
  @{ */
#define BOARD_C012_D5_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D5_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D5_PIN 12U   /*!<@brief 0U pin index: 12 */
                                /* @} */

/*! @name PIO0_13 (number 48), C012 D6
  @{ */
#define BOARD_C012_D6_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D6_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D6_PIN 13U   /*!<@brief 0U pin index: 13 */
                                /* @} */

/*! @name PIO0_14 (number 49), C012 D7
  @{ */
#define BOARD_C012_D7_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_D7_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_D7_PIN 14U   /*!<@brief 0U pin index: 14 */
                                /* @} */

/*! @name PIO0_18 (number 58), C012 RS0
  @{ */
#define BOARD_C012_RS0_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_RS0_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_RS0_PIN 18U   /*!<@brief 0U pin index: 18 */
                                 /* @} */

/*! @name PIO0_19 (number 59), C012 RS1
  @{ */
#define BOARD_C012_RS1_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_RS1_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_RS1_PIN 19U   /*!<@brief 0U pin index: 19 */
                                 /* @} */

/*! @name PIO0_20 (number 60), C012 RnotW
  @{ */
#define BOARD_C012_RNOTW_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_RNOTW_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_RNOTW_PIN 20U   /*!<@brief 0U pin index: 20 */
                                   /* @} */

/*! @name PIO0_31 (number 13), Button
  @{ */
#define BOARD_BUTTON_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_BUTTON_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_BUTTON_PIN 31U   /*!<@brief 0U pin index: 31 */
                               /* @} */

/*! @name CTIMER1_MAT0 (number 51), Speaker
  @{ */
/* @} */

/*! @name PIO1_10 (number 30), Analyse
  @{ */
#define BOARD_ANALYSE_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_ANALYSE_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_ANALYSE_PIN 10U   /*!<@brief 1U pin index: 10 */
                                /* @} */

/*! @name PIO1_9 (number 29), Error
  @{ */
#define BOARD_ERROR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_ERROR_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_ERROR_PIN 9U    /*!<@brief 1U pin index: 9 */
                              /* @} */

/*! @name PIO1_3 (number 17), LED
  @{ */
#define BOARD_LED_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_LED_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_LED_PIN 3U    /*!<@brief 1U pin index: 3 */
                            /* @} */

/*! @name FC0_RXD_SDA_MOSI (number 31), U18[4]/TO_MUX_P0_0-ISP_RX
  @{ */
/* @} */

/*! @name FC0_TXD_SCL_MISO (number 32), U6[4]/U22[3]/P0_1-ISP_TX
  @{ */
/* @} */

/*! @name PIO0_22 (number 63), C012 notCS
  @{ */
#define BOARD_C012_NOTCS_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_NOTCS_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_NOTCS_PIN 22U   /*!<@brief 0U pin index: 22 */
                                   /* @} */

/*! @name PIO0_23 (number 1), C012 Output Int
  @{ */
#define BOARD_C012_OUTPUT_INT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_OUTPUT_INT_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_OUTPUT_INT_PIN 23U   /*!<@brief 0U pin index: 23 */
                                        /* @} */

/*! @name PIO0_24 (number 2), C012 Input Interrupt
  @{ */
#define BOARD_C012_INPUT_INT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_INPUT_INT_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_INPUT_INT_PIN 24U   /*!<@brief 0U pin index: 24 */
                                       /* @} */

