DigiFennek/TransputerBox/MCUXpresso/transputerBox_WinUSB_cm4/board/pin_mux.h
/*! @name PIO0_25 (number 3), C012 Reset
  @{ */
#define BOARD_C012_RESET_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_C012_RESET_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_C012_RESET_PIN 25U   /*!<@brief 0U pin index: 25 */
                                   /* @} */

/*! @name PIO0_21 (number 61), Debug Pin
  @{ */
#define BOARD_DEBUG_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_DEBUG_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_DEBUG_PIN 21U   /*!<@brief 0U pin index: 21 */
                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_DIGITAL_EN 0x80u    /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INPFILT_OFF 0x0100u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name FC0_RXD_SDA_MOSI (number 31), U18[4]/TO_MUX_P0_0-ISP_RX
  @{ */
/* @} */

/*! @name FC0_TXD_SCL_MISO (number 32), U6[4]/U22[3]/P0_1-ISP_TX
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Core0(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
